load-tests/artillery/artillery.mqtt.yml
config:
  target: "mqtt://localhost:1883"
  phases:
    - duration: 60
      arrivalRate: 50
  engines:
    mqtt: {}
  plugins:
    influxdb:
      protocol: http
      host: localhost
      port: 8086
      database: artillery
scenarios:
  - engine: mqtt
    flow:
      - subscribe:
          topic: "chat"
      - subscribe:
          topic: "powerups"
      - loop:
          - publish:
              topic: "chat"
              payload: "hello"
          - publish:
              topic: "powerups"
              payload: "speed"
          - think: 1
        count: 5